# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'
tap 'mongodb/brew'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'cocoapods'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'go'
brew 'heroku'
brew 'imageoptim-cli'
brew 'lzo'
brew 'mas' # Mac App Store manager
brew 'mongodb-community@4.4'
brew 'mongosh'
brew 'mysql' # Installs latest version of MySQL
brew 'pgcli'
brew 'postgresql', restart_service: true
brew 'watchman'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Cask Apps
cask 'adobe-creative-cloud'
cask 'android-studio'
cask 'brave-browser'
cask 'cyberduck'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'firefox'
cask 'flipper'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'ganache'
cask 'google-chrome'
cask 'gpg-suite'
cask 'graphql-playground'
cask 'imageoptim'
cask 'iterm2'
cask 'kindle'
cask 'kitematic'
cask 'miro'
cask 'mysqlworkbench'
cask 'navicat-for-postgresql'
cask 'postman'
cask 'react-native-debugger'
cask 'robo-3t'
cask 'sequel-pro'
cask 'signal'
cask 'sketch'
cask 'slack'
cask 'steam'
cask 'tower'
cask 'spotify'
cask 'vlc'
cask 'visual-studio-code'
cask 'zeplin'
cask 'zoom'

# Mac Store apps via mas
# https://github.com/mas-cli/mas
mas 'Barracuda VPN Client', id: 1555242566
mas 'Boop', id: 1518425043
mas 'Space Gremlin', id: 414515628
