# Taps
tap 'homebrew/cask-fonts'
tap 'mongodb/brew'
tap 'facebook/fb'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'cfn-lint'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'go'
brew 'idb-companion'
brew 'imagemagick'
brew 'imageoptim-cli'
brew 'lzo' # Data compression library
brew 'mas' # Mac App Store manager
brew 'mongodb-community@4.4'
brew 'mongosh'
brew 'mysql' # Installs latest version of MySQL
brew 'neovim'
brew 'pandoc'
brew 'pgcli'
brew 'php'
brew 'phpunit'
brew 'postgresql', restart_service: true
brew 'pwgen'
brew 'redis'
brew 'saml2aws'
brew 'tmux'
brew 'watchman'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Cask Apps
cask 'adobe-creative-cloud'
cask 'android-studio'
cask 'cyberduck'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'divvy'
cask 'firefox'
cask 'flipper'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'gpg-suite'
cask 'graphql-playground'
cask 'imageoptim'
cask 'iterm2'
cask 'kindle'
cask 'mysqlworkbench'
cask 'navicat-for-postgresql'
cask 'postman'
cask 'react-native-debugger'
cask 'robo-3t'
cask 'sequel-pro'
cask 'tower'
cask 'vlc'
cask 'visual-studio-code'

# Mac Store apps via mas
# https://github.com/mas-cli/mas
mas 'Boop', id: 1518425043
mas 'Space Gremlin', id: 414515628
mas 'Xcode', id: 497799835
