# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'go'
brew 'heroku'
brew 'lzo'
brew 'mas' # Mac App Store manager
brew 'mysql' # Installs latest version of MySQL
brew 'pgcli'
brew 'postgresql', restart_service: true
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Cask Apps
cask 'adobe-creative-cloud'
cask 'brave-browser'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'google-chrome'
cask 'iterm2'
cask 'kitematic'
cask 'mysqlworkbench'
cask 'navicat-for-postgresql'
cask 'postman'
cask 'sketch'
cask 'slack'
cask 'sequel-pro'
cask 'tower'
cask 'spotify'
cask 'vlc'
cask 'zeplin'
cask 'zoomus'

# Mac Store apps via mas
# https://github.com/mas-cli/mas
mas 'Xcode', id: 497799835
mas 'Space Gremlin', id: 414515628
