amazonwebservices.aws-toolkit-vscode
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
castwide.solargraph
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
eeyore.yapf
esbenp.prettier-vscode
expo.vscode-expo-tools
github.codespaces
github.copilot
github.copilot-chat
github.copilot-labs
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
hbenl.vscode-test-explorer
herrmannplatz.npm-dependency-links
jemmyw.rails-fast-nav
jnbt.vscode-rufo
juanblanco.solidity
kddejong.vscode-cfn-lint
misogi.ruby-rubocop
ms-azuretools.vscode-docker
ms-python.autopep8
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
octref.vetur
prisma.prisma
rangav.vscode-thunder-client
redhat.vscode-yaml
rust-lang.rust-analyzer
shopify.ruby-lsp
streetsidesoftware.code-spell-checker
sysoev.vscode-open-in-github
threadheap.serverless-ide-vscode
tombonnike.vscode-status-bar-format-toggle
vscode-icons-team.vscode-icons
vscodevim.vim
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
wix.glean
wix.vscode-import-cost
yzhang.markdown-all-in-one
