amazonwebservices.aws-toolkit-vscode
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
byCedric.vscode-expo
castwide.solargraph
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
GitHub.codespaces
GitHub.copilot
GitHub.copilot-labs
golang.go
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
hashicorp.terraform
hbenl.vscode-test-explorer
herrmannplatz.npm-dependency-links
jemmyw.rails-fast-nav
jnbt.vscode-rufo
JuanBlanco.solidity
kddejong.vscode-cfn-lint
misogi.ruby-rubocop
ms-azuretools.vscode-docker
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
octref.vetur
Prisma.prisma
rangav.vscode-thunder-client
rebornix.ruby
redhat.vscode-yaml
silvenon.mdx
streetsidesoftware.code-spell-checker
sysoev.vscode-open-in-github
ThreadHeap.serverless-ide-vscode
tombonnike.vscode-status-bar-format-toggle
vscode-icons-team.vscode-icons
vscodevim.vim
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
wix.vscode-import-cost
